{
  "_name_or_path": "bookbot/distil-ast-audioset",
  "architectures": [
    "ASTForAudioClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "frequency_stride": 10,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "belly_pain",
    "1": "burping",
    "2": "discomfort",
    "3": "hungry",
    "4": "tired"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "belly_pain": "0",
    "burping": "1",
    "discomfort": "2",
    "hungry": "3",
    "tired": "4"
  },
  "layer_norm_eps": 1e-12,
  "max_length": 1024,
  "model_type": "audio-spectrogram-transformer",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "num_mel_bins": 128,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "time_stride": 10,
  "torch_dtype": "float32",
  "transformers_version": "4.35.0"
}
